import 'package:get/get.dart';

class MyTranslation extends Translations{
  @override
  Map<String, Map<String, String>> get keys => {
    "ar": {

      //صفحة اللغات
      "1": "اختر اللغة",
      "2":"العربيه",
      "3": "الانجليزيه",

/*============================================================================================================*/
      //تنبيه الخروج التطبيق
      "4":"تنبيه",
      "5":"هل تريد الخروج من التطبيق",
      "6":"تاكيد",
      "7":"الغاء",

/*============================================================================================================*/
      //صفحات الإعداد

      "a": "جلوكوما العين",
      "A": "حالة شائعة في العين\n حيث يتضرر العصب البصري، الذي يربط العين\n بالدماغ.",

      "b": "اعتلال الشبكية السكري",
      "B":"ينطوي على نمو الأوعية\n الدموية غير الطبيعية في شبكية العين.",

      "c":"إعتام عدسة العين",
      "C":"منطقة غائمة في عدسة \nعينك",

      "d":"البقعة الصفراء السكري",
      "D":"سماكة الشبكية الناتجة عن\n تراكم السائل داخل الشبكية.",
      "e":"متابعه",


/*============================================================================================================*/

      //المصادقة
      "10": "تسجيل الدخول",
      "11":"فحص",
      "12":"يمكنك تسجيل الدخول من خلال البريد وكلمة المرور او من خلال وسائل التواصل الاجتماعي",
      "13": "ادخل البريد الالكتروني",
      "14": "ادخل كلمة المرور",
      "15": "هل نسيت كلمة المرور",
      "16": "تسجيل الدخول",
      "17": "ليس لديك حساب ? ",
      "18": "انشاء حساب",
      "19": "البريد الالكتروني",
      "20": "كلمة المرور",
      "21": "اسم المستخدم",
      "22": "رقم الهاتف",
      "23": "ادخل رقم الهاتف",
      "24": "ادخل اسم المستخدم",
      "25":"انشاء حساب من خلال البريد وكلمة المرور او من خلال وسائل التواصل الاجتماعي",
      "26": " لديك حساب ? ",
      "27": "تسجيل الدخول",
      "28": "فحص البريد الالكتروني",
      "29": "تم انشاء الحساب بنجاح",
      "30": "الرجاء ادخال البريد لتلقي رمز التحقق",
      "31": "فحص",
      "32": "الذهاب لتسجيل الدخول",
      "33": "نجاح",
      "34": "حفظ",
      "35": "الرجاء ادخال كلمة المرور الجديدة",
      "36": "الكلمة الجديدة",
      "37": "تم اعادة تعيين كلمة المرور بنجاح",
      "38": "تهانينا",
      "39": "تم التسجيل بنجاح",
      "40":"انشاء حساب",
      "41":"رمز التحقق",
      "42":"التحقق من الرمز",
      "43":"الرجاء إدخال الرمز الرقمي المرسل إلى بريدك الإلكتروني",
      "44":"إعادة تعيين كلمة المرور",
      "45":"كلمة المرور الجديدة",
      "46":"الرجاء إدخال كلمة المرور الجديدة",
      "47":"أعد إدخال كلمة المرور",
      "48":"اسم المستخدم غير صحيح",
      "49":"بريد إلكتروني غير صحيح",
      "50":"هاتف غير صحيح",
      "51":"لا يمكن أن تكون فارغة",
      "52":"لا يمكن أن يكون أقل من",
      "53":"لا يمكن أن يكون أكبر من",
      "54":"أسئلة",
      "55" : "تم تسجيل الدخول بنجاح",
      "56" : "تم تسجيل الخروج بنجاح",




/*============================================================================================================*/

    },

    "en": {

      //Languages Page
      "1": "Choose Language",
      "2": "Arabic",
      "3": "English",

/*============================================================================================================*/
      // Alert Exit App
      "4":"Alert",
      "5":"Do you want to exit the application?",
      "6":"Ok",
      "7":"Cancel",
/*============================================================================================================*/

      //OnBoarding Pages
      "a": "Glaucoma Eye",
      "A":"A Common eye condition where the optic nerve,\n Which connects the eye to the brain, Becomes\n damaged.",

      "b":"Diabetic Retinopathy",
      "B":"Involves the growth of\nabnormal blood vessels in the retina.",

      "c":"Cataracts",
      "C":"A cloudy area in the lens of your\n eye ",

      "d":"Diabetic Macular",
      "D":"Retinal thickening caused by\n the accumulation of intraretinal fluid.",
      "e":"Continue",

      /*============================================================================================================*/
      //Authentication

      "10": "Sign In",
      "11":"CheckUp",
      "12":"Sign In Your Email And Password Or  Continue With Social Media",
      "13": "Enter Your Email",
      "14": "Enter Your Password",
      "15": "Forget Password",
      "16": "Sign In",
      "17": "Dont Have An Account ? ",
      "18": "Sign Up",
      "19": "Email",
      "20": "Password",
      "21": "Username",
      "22": "Phone",
      "23": "Enter Your Phone",
      "24": "Enter Your Username",
      "25":"Sign Up With Your Email And Password OR Continue With Social Media",
      "26": " have an account ? ",
      "27": "SignIn" ,
      "28" : "Check Email" ,
      "29" : "Success SignUp"  ,
      "30" : "please Enter Your Email Address To Receive A verification code" ,
      "31" : "Check" ,
      "32" : "Go To Login" ,
      "33" : "Success" ,
      "34" : "Save" ,
      "35" : "Please Enter new Password" ,
      "36" : "New Password" ,
      "37" : "Password has been reset successfully" ,
      "38" : "Congratulations" ,
      "39" : "successfully registered",
      "40":"SignUp",
      "41":"Verification Code",
      "42":"Check Code",
      "43":"Please Enter The Digit Code Sent To Your Email",
      "44":"Reset Password",
      "45":"New Password",
      "46":"Please Enter new Password",
      "47":"Re Enter Your Password",
      "48":"not valid username",
      "49":"not valid email",
      "50":"not valid phone",
      "51":"Can't be Empty",
      "52":"can't be less than",
      "53":"can't be larger than",
      "54":"Questions",
      "55" : "successfully logged in",
      "56" : "successfully logged off",

      /*============================================================================================================*/











    }



  };

}